; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-60)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c2)
    (capacity v4 c1)
    (capacity v5 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l10)
    (at p2 l4)
    (at p3 l5)
    (at p4 l8)
    (at p5 l12)
    (at p6 l4)
    (at p7 l6)
    (at p8 l8)
    (at p9 l2)
    (at p10 l5)
    (at v1 l4)
    (at v2 l3)
    (at v3 l2)
    (at v4 l8)
    (at v5 l9)
    (road l12 l7)
    (road l4 l9)
    (road l3 l7)
    (road l5 l1)
    (road l8 l9)
    (road l9 l8)
    (road l10 l9)
    (road l6 l2)
    (road l7 l10)
    (road l5 l3)
    (road l9 l4)
    (road l9 l10)
    (road l11 l1)
    (road l1 l5)
    (road l1 l11)
    (road l7 l3)
    (road l7 l12)
    (road l3 l2)
    (road l3 l5)
    (road l10 l7)
    (road l2 l3)
    (road l2 l6)
    (road l8 l11)
    (road l11 l8)
    (road l1 l6)
    (road l6 l1)
    (road l10 l11)
    (road l11 l10)
    (road l5 l7)
    (road l7 l5)
    (road l2 l5)
    (road l5 l2)
    (road l5 l10)
    (road l10 l5)
    (road l7 l9)
    (road l9 l7)
    (road l4 l12)
    (road l12 l4)
    (road l2 l10)
    (road l10 l2)
    (road l1 l10)
    (road l10 l1)
    (road l1 l12)
    (road l12 l1)
    (road l4 l5)
    (road l5 l4)
    (road l3 l8)
    (road l8 l3)
    (road l5 l8)
    (road l8 l5)
    (road l6 l12)
    (road l12 l6)
    (road l6 l7)
    (road l7 l6)
    (road l6 l9)
    (road l9 l6)
    (road l10 l12)
    (road l12 l10)
    (road l7 l8)
    (road l8 l7)
    (road l5 l6)
    (road l6 l5)
    (road l6 l8)
    (road l8 l6)
    (road l4 l10)
    (road l10 l4)
    (road l1 l8)
    (road l8 l1)
    (road l2 l11)
    (road l11 l2)
    (road l3 l6)
    (road l6 l3)
    (road l3 l9)
    (road l9 l3)
    (road l7 l11)
    (road l11 l7)
    )
 (:goal (and 
(at p5 l6)
))
)

; plan
1. (drive v1 l4 l12)
   deleted: (at v1 l4)
   added: (at v1 l12)
   goals met: 0 of 1
2. (pick-up v1 l12 p5 c0 c1)
   deleted: (at p5 l12) (capacity v1 c1)
   added: (in p5 v1) (capacity v1 c0)
   goals met: 0 of 1
3. (drive v1 l12 l6)
   deleted: (at v1 l12)
   added: (at v1 l6)
   goals met: 0 of 1
4. (drop v1 l6 p5 c0 c1)
   deleted: (in p5 v1) (capacity v1 c0)
   added: (at p5 l6) (capacity v1 c1)
   goals met: 1 of 1
